changed ascii code to mermaid
